Emekuu/STM32-Switching-algorithm-for-energetic-systems/BLE_DataThroughput/STM32_WPAN/App/dt_client_app.c
/**
  ******************************************************************************
 * @file    dt_client_app.c
 * @author  MCD Application Team
 * @brief   data throughput client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"

#include "dbg_trace.h"

#include "ble.h"
#include "app_ble.h"    
#include "dt_client_app.h"
#include "dts.h"
#include <string.h>
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
#if 0
typedef enum
{
  GATT_PROC_MTU_UPDATE,
  GATT_PROC_DISC_ALL_PRIMARY_SERVICES,
  GATT_PROC_DISC_ALL_CHAR_OF_DT_SERVICE,
  GATT_PROC_DISC_TX_CHAR_DESC,
} GattProcId_t;

typedef struct
{
  /**
   * connection handle
   */
  uint16_t connHandle;

  /**
   * handle of the Data Transfer service
   */
  uint16_t DataTransferServiceHandle;

  /**
   * end handle of the Data Transfer service
   */
  uint16_t DataTransferServiceEndHandle;

  /**
   * handle of the Tx characteristic
   *
   */
  uint16_t DataTransferTxCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Tx characteristic
   */
  uint16_t DataTransferTxDescHandle;

} DataTransferContext_t;
#else
typedef enum
{  
  DTC_UNINITIALIZED                                 = 0,
  DTC_INITIALIZED                                   = 1,
  DTC_IDLE                                          = 2,
  DTC_DISC_ALL_PRIMARY_SERVICES                     = 3,
  DTC_DISCOVER_CHARACS                              = 4,
  DTC_DISCOVER_DESC                                 = 5,
  DTC_READ_TX                                       = 6,
  DTC_READ_TX_CCC                                   = 7,
  DTC_READ_RX                                       = 8,
  DTC_WRITE_TX                                      = 9,
  DTC_ENABLE_TX_NOTIFICATION                        = 10,
  DTC_DISABLE_TX_NOTIFICATION                       = 11,
  DTC_ENABLE_THROUGHPUT_NOTIFICATION                = 12,
  DTC_DISABLE_THROUGHPUT_NOTIFICATION               = 13,
  DTC_CONNECTED                                     = 14,
  DTC_CONNECTED_ADVERTISING                         = 15,
  DTC_PROC_MTU_UPDATE                               = 16
}  DTC_SVC_ProfileState;

typedef enum
{
  DTC_APP_FLOW_OFF,
  DTC_APP_FLOW_ON
} DTC_App_Flow_Status_t;

typedef enum
{
  DTC_APP_TRANSFER_REQ_OFF,
  DTC_APP_TRANSFER_REQ_ON
} DTC_App_Transfer_Req_Status_t;






typedef struct
{
  /**
   * state of the CRC
   * state machine
   */ 
  DTC_SVC_ProfileState state;

  /**
   * connection handle 
   */ 
  uint16_t connHandle;

  /**
   * handle of the CRC service
   */ 
  uint16_t ServiceHandle;

  /**
   * end handle of the CRC service
   */ 
  uint16_t ServiceEndHandle;

  /**
   * handle of the TX characteristic 
   * 
   */ 
  uint16_t TXCharHdle;

  /**
   * handles of the TX Client Characteristic Configuration descriptor 
   * 
   */ 
  uint16_t TXCCCDescHdle;

  /**
   * handles of the RX characteristic 
   * 
   */ 
  uint16_t RXCharHdle;

  /**
   * handle of the Throughput characteristic 
   * 
   */ 
  uint16_t ThroughputCharHdle;

  /**
   * handles of the Throughput Client Characteristic Configuration descriptor 
   * 
   */ 
  uint16_t ThroughputCCCDescHdle;

  DTS_STM_Payload_t TxData;
  DTC_App_Transfer_Req_Status_t NotificationTransferReq;
  DTC_App_Transfer_Req_Status_t ButtonTransferReq;
  DTC_App_Flow_Status_t DtFlowStatus;
}DTC_Context_t;

#endif

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */


/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
    (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
    (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))

#define DEFAULT_TS_MEASUREMENT_INTERVAL   (1000000/CFG_TS_TICK_VAL)  /**< 1s */          
#define TIMEUNIT                          1
#define DATA_THROUGHPUT_MEASUREMENT       (TIMEUNIT*DEFAULT_TS_MEASUREMENT_INTERVAL)

#define READ_RX                                                                0
#define READ_TX                                                                1
#define READ_RX_CCC_DESC                                                       2
          
#define WRITE_TX                                                               0
#define WRITE_ENABLE_RX_NOTIFICATION                                           1
#define WRITE_DISABLE_RX_NOTIFICATION                                          2

#define TX_CHAR                                                                1
#define RX_CHAR                                                                2

#define BOUNCE_THRESHOLD                                                   20U
#define LONG_PRESS_THRESHOLD                                               1000U
/* USER CODE BEGIN PM */
#define F767_I2C_ADDR      (0x12 << 1)   // uprav podľa tvojho slave
#define I2C_FWD_MAX_LEN    244
#define I2C_FWD_TIMEOUT_MS 100
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static DTC_Context_t DTC_Context;

/**
 * END of Section BLE_APP_CONTEXT
 */
static uint16_t packet_lost;
static uint32_t DataThroughputValue;
static uint32_t packet_lost_local;
static uint32_t TotalDataReceived = 0;
static uint32_t Nbr_packet = 0;
static DTS_STM_App_Notification_evt_t NotificationData;
static uint8_t TimerDataThroughput_Id;
uint32_t N=0;
uint32_t DataTransfered = 0;
uint16_t Att_Mtu_Exchanged;

/* USER CODE BEGIN PV */
extern I2C_HandleTypeDef hi2c1;
/* USER CODE END PV */

/* Private functions prototypes-----------------------------------------------*/
static void DTC_App_Button1_Trigger_Received( void );
static void DTC_App_Button2_Trigger_Received( void );
static void DTC_App_Button3_Trigger_Received( void );
static void SendData(void);
static SVCCTL_EvtAckStatus_t DTC_Event_Handler( void *Event );
static void DataThroughputTimer( void );
static void DataThroughput_Calculation(void);
static void GattProcReq(DTC_SVC_ProfileState GattProcId);
static uint8_t Notification_Data_Buffer[DATA_NOTIFICATION_MAX_PACKET_SIZE]; /* DATA_NOTIFICATION_MAX_PACKET_SIZE data + CRC */
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/*************************************************************
 *
 * PUBLIC FUNCTIONS
 *
 *************************************************************/
typedef struct __attribute__((packed))
{
    uint32_t seq;
    uint32_t tx_ts_ms;
    uint8_t  path_id;
    uint8_t  reserved[3];
} lab_test_hdr_t;
typedef struct __attribute__((packed))
{
    uint8_t  hdr;        // 0xA5
    int8_t   rssi;
    uint16_t loss;
    uint16_t delay_ms;
    uint8_t  jitter;
    uint8_t  checksum;
} bt_metric_frame_t;

