Emekuu/STM32-Switching-algorithm-for-energetic-systems/BLE_DataThroughput/STM32_WPAN/App/dt_client_app.c
typedef struct {
    uint32_t seq;
    uint32_t tx_ts_ms;
    uint16_t payload_len;
    uint8_t  path_id;
    uint8_t  has_tx_ts;
} generic_frame_info_t;

static uint8_t Client_ParseFrame(const uint8_t *payload,
                                 uint16_t len,
                                 generic_frame_info_t *out)
{
    if ((payload == NULL) || (out == NULL))
        return 0U;

    memset(out, 0, sizeof(*out));

    if (len < sizeof(lab_test_hdr_t))
        return 0U;

    const lab_test_hdr_t *hdr = (const lab_test_hdr_t *)payload;

    out->seq = hdr->seq;
    out->tx_ts_ms = hdr->tx_ts_ms;
    out->payload_len = len;
    out->path_id = hdr->path_id;
    out->has_tx_ts = 1U;

    return 1U;
}



void DTC_App_Init( void )
{
  uint8_t i;

  SVCCTL_RegisterCltHandler(DTC_Event_Handler);

  UTIL_SEQ_RegTask( 1<<CFG_TASK_SW1_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, DTC_App_Button1_Trigger_Received);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_SW2_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, DTC_App_Button2_Trigger_Received);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_SW3_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, DTC_App_Button3_Trigger_Received);
  UTIL_SEQ_RegTask( 1<< CFG_TASK_APP_DATA_THROUGHPUT_ID, UTIL_SEQ_RFU, DataThroughput_Calculation);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_DATA_TRANSFER_UPDATE_ID, UTIL_SEQ_RFU, SendData);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_DATA_PHY_UPDATE_ID, UTIL_SEQ_RFU, BLE_SVC_GAP_Change_PHY);

  /* Create timer for Data Throughput */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(TimerDataThroughput_Id), hw_ts_SingleShot, DataThroughputTimer);

  /**
   * Initialize data buffer
   */
  for (i=0 ; i<(DATA_NOTIFICATION_MAX_PACKET_SIZE-1) ; i++)
  {
    Notification_Data_Buffer[i] = i;
  }

  DTC_Context.state = DTC_IDLE;
  DTC_Context.connHandle = 0xFFFF;
  DTC_Context.NotificationTransferReq = DTC_APP_TRANSFER_REQ_OFF;
  DTC_Context.ButtonTransferReq = DTC_APP_TRANSFER_REQ_OFF;
  DTC_Context.DtFlowStatus = DTC_APP_FLOW_ON;

  APP_DBG_MSG("-- DT CLIENT INITIALIZED \n");

  return;
}

void DTC_App_KeyButton1Action( void )
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_SW1_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);
}

void DTC_App_KeyButton2Action( void )
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_SW2_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);
}

void DTC_App_KeyButton3Action( void )
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_SW3_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);
}

void DTC_App_LinkReadyNotification(uint16_t ConnectionHandle)
{
  DTC_Context.connHandle = ConnectionHandle;

#if(BLE_CFG_CENTRAL != 1)
  GattProcReq(DTC_PROC_MTU_UPDATE);
#endif
#if(BLE_CFG_PERIPHERAL != 1)
  GattProcReq(DTC_DISC_ALL_PRIMARY_SERVICES);
  GattProcReq(DTC_DISCOVER_CHARACS);
  GattProcReq(DTC_DISCOVER_DESC);
  GattProcReq(DTC_ENABLE_TX_NOTIFICATION);
  GattProcReq(DTC_ENABLE_THROUGHPUT_NOTIFICATION);
#endif
  
#if(BLE_CFG_CENTRAL != 0)
    UTIL_SEQ_SetTask(1<<CFG_TASK_CONN_UPDATE_ID, CFG_SCH_PRIO_0); 
#endif
  return;
}

/*************************************************************
 *
 * CALLBACK FUNCTIONS
 *
 *************************************************************/
static void WB_Test_I2C_Ping(void)
{
    uint8_t test[1] = {0xA5};
    HAL_StatusTypeDef ret;
    uint32_t err;

    ret = HAL_I2C_Master_Transmit(&hi2c1, F767_I2C_ADDR, test, sizeof(test), 100);

    if (ret != HAL_OK)
    {
        err = HAL_I2C_GetError(&hi2c1);
        APP_DBG_MSG("[PING] I2C TX error: ret=%d err=0x%08lX addr=0x%02X\n",
                    ret, err, F767_I2C_ADDR);
    }
    else
    {
        APP_DBG_MSG("[PING] I2C TX OK addr=0x%02X\n", F767_I2C_ADDR);
    }
}
static uint32_t s_last_seq = 0;
static uint32_t s_lost = 0;
static uint32_t s_total = 0;

static void ForwardMetricsToF767(const generic_frame_info_t *info,
                                  const uint8_t *raw, uint16_t len)
{
    uint16_t send_len = (len > I2C_FWD_MAX_LEN) ? I2C_FWD_MAX_LEN : len;
    HAL_StatusTypeDef ret = HAL_I2C_Master_Transmit(
        &hi2c1, F767_I2C_ADDR,
        (uint8_t*)raw, send_len,
        I2C_FWD_TIMEOUT_MS);
    APP_DBG_MSG("[FWD] seq=%lu ret=%d\n", (unsigned long)info->seq, ret);
}
static SVCCTL_EvtAckStatus_t DTC_Event_Handler( void *Event )
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt * event_pckt;
  evt_blecore_aci * blecore_evt;
  uint8_t CRC_Result;
  uint8_t CRC_Received;

  return_value = SVCCTL_EvtNotAck;
  event_pckt = (hci_event_pckt *) (((hci_uart_pckt*) Event)->data);

  switch (event_pckt->evt)
  {
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      blecore_evt = (evt_blecore_aci*) event_pckt->data;
      switch (blecore_evt->ecode)
      {

        case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
        {
          Resume_Write();
        }
        break;
        
        case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
        {
          aci_att_read_by_group_type_resp_event_rp0 *pr = (void*) blecore_evt->data;
          uint8_t numServ, i, idx;
          uint16_t uuid, handle;

          handle = pr->Connection_Handle;

          APP_DBG_MSG("DTC_Event_Handler: ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE\n");

          DTC_Context.connHandle = handle;

          numServ = (pr->Data_Length) / pr->Attribute_Data_Length;

          /* the event data will be
           * 2bytes start handle
           * 2bytes end handle
           * 2 or 16 bytes data
           * we are interested only if the UUID is 16 bit.
           * So check if the data length is 6
           */
#if (UUID_128BIT_FORMAT==1)
          idx = 16;
          if (pr->Attribute_Data_Length == 20)
#else
          idx = 4;
          if (pr->Attribute_Data_Length == 6)
#endif
          {
            for (i = 0; i < numServ; i++)
            {
              uuid = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx]);
              if (uuid == DT_SERVICE_UUID)
              {
#if (UUID_128BIT_FORMAT==1)
                DTC_Context.ServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
                DTC_Context.ServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
#else
                DTC_Context.ServiceHandle =
                    UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx - 4]);
                DTC_Context.ServiceEndHandle =
                    UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx - 2]);
#endif
                APP_DBG_MSG("DTC_Event_Handler: DT_SERVICE_UUID found !\n");
              }
              idx += 6;
            }
          }
        }
        break;

        case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
        {
          aci_att_read_by_type_resp_event_rp0 *pr = (void*) blecore_evt->data;
          uint8_t idx;
          uint16_t uuid, handle;

          APP_DBG_MSG("DTC_Event_Handler: ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE\n");

          /* the event data will be
           * 2 bytes start handle
           * 1 byte char properties
           * 2 bytes handle
           * 2 or 16 bytes data
           */
#if (UUID_128BIT_FORMAT==1)
          idx = 17;
          if (pr->Handle_Value_Pair_Length == 21)
#else
          idx = 5;
          /* we are interested in only 16 bit UUIDs */
          if (pr->Handle_Value_Pair_Length == 7)
#endif
          {
//            pr->Data_Length -= 1;
            while(pr->Data_Length > 0)
            {
              uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx]);
              /* store the characteristic handle not the attribute handle */
#if (UUID_128BIT_FORMAT==1)
              handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-14]);
#else
              handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx - 2]);
#endif
              if (uuid == DT_TX_CHAR_UUID)
              {
                DTC_Context.TXCharHdle = handle;
                APP_DBG_MSG("DTC_Event_Handler: DT_TX_CHAR_UUID found !\n");
              }
              else if (uuid == DT_RX_CHAR_UUID)
              {
                DTC_Context.RXCharHdle = handle;
                APP_DBG_MSG("DTC_Event_Handler: DT_RX_CHAR_UUID found !\n");
              }
              else if (uuid == DT_THROUGHPUT_CHAR_UUID)
              {
                DTC_Context.ThroughputCharHdle = handle;
                APP_DBG_MSG("DTC_Event_Handler: DT_THROUGHPUT_CHAR_UUID found !\n");
              }
#if (UUID_128BIT_FORMAT==1)
              pr->Data_Length -= 21;
              idx += 21;
#else
              pr->Data_Length -= 7;
              idx += 7;
#endif
            }
          }
        }
        break;
        
        case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
        {
          aci_att_find_info_resp_event_rp0 *pr = (void*) blecore_evt->data;
          uint8_t numDesc, idx, i;
          uint16_t uuid, handle;

