Emekuu/STM32-Switching-algorithm-for-energetic-systems/BLE_DataThroughput/STM32_WPAN/App/dt_client_app.c
          /*
           * event data will be of the format
           * 2 bytes handle
           * 2 bytes UUID
           */
          numDesc = (pr->Event_Data_Length) / 4;
          /* we are interested only in 16 bit UUIDs */
          idx = 0;
          if (pr->Format == UUID_TYPE_16)
          {
            for (i = 0; i < numDesc; i++)
            {
              handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx]);
              uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx + 2]);

              if (uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID)
              {
                if(handle == DTC_Context.TXCharHdle + 1)
                {
                  APP_DBG_MSG("DTC_Event_Handler: DTC_DISCOVER_TX_CHAR_DESC ready to enable notification\n");
                  DTC_Context.TXCCCDescHdle = handle;
                }
                else if(handle == DTC_Context.ThroughputCharHdle + 1) 
                {
                  APP_DBG_MSG("DTC_Event_Handler: DTC_DISCOVER_THROUGHPUT_CHAR_DESC ready to enable notification\n");
                  DTC_Context.ThroughputCCCDescHdle = handle;
                }
              }
              idx += 4;
            }
          }
        }
        break; /*ACI_ATT_FIND_INFO_RESP_VSEVT_CODE*/

        case ACI_GATT_NOTIFICATION_VSEVT_CODE:
        {
          aci_gatt_notification_event_rp0 *pr = (void*) blecore_evt->data;
          APP_DBG_MSG("[NOTIF] handle=0x%04X TX=0x%04X TP=0x%04X\n",
                          pr->Attribute_Handle,
                          DTC_Context.TXCharHdle,
                          DTC_Context.ThroughputCharHdle);
          if ((pr->Attribute_Handle == DTC_Context.TXCharHdle) &&
              (pr->Attribute_Value_Length >= sizeof(lab_test_hdr_t)))
          {
            generic_frame_info_t info;
            memset(&info, 0, sizeof(info));

            NotificationData.DataTransfered.Length  = pr->Attribute_Value_Length;
            NotificationData.DataTransfered.pPayload = pr->Attribute_Value;

            if (Client_ParseFrame(pr->Attribute_Value,
                                  pr->Attribute_Value_Length,
                                  &info))
            {
                if (DataTransfered == 0)
                {
                    HW_TS_Start(TimerDataThroughput_Id, DATA_THROUGHPUT_MEASUREMENT);
                }

                DataTransfered += pr->Attribute_Value_Length;
                ForwardMetricsToF767(&info, pr->Attribute_Value, pr->Attribute_Value_Length);
            }
            else
            {
              APP_DBG_MSG("Parse error, len=%u\n", pr->Attribute_Value_Length);
            }
          }
        }
        break;
/* end ACI_GATT_NOTIFICATION_VSEVT_CODE */

        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);
        }
        break; /*ACI_GATT_PROC_COMPLETE_VSEVT_CODE*/

        default:
          break;
      }
    }
    break;
    
    default:
      break;
 }

  return (return_value);
}

  /*************************************************************
   *
   * LOCAL FUNCTIONS
   *
   *************************************************************/
  static void DataThroughput_Calculation( void )
  {
    uint32_t MoyData;

    if (Nbr_packet < 600)
    {
      Nbr_packet++;
      TotalDataReceived += DataThroughputValue;
    }
    if (Nbr_packet == 600)
    {
      MoyData = TotalDataReceived / 600;
      APP_DBG_MSG("Moy = %ld bytes/s \n",MoyData);
      TotalDataReceived = 0;
      Nbr_packet = 0;
    }

    APP_DBG_MSG("DataThroughput = %ld bytes/s lost = %ld \n",DataThroughputValue, packet_lost_local);
  }

  static void DataThroughputTimer( void )
  {
    DataThroughputValue = (uint32_t)(DataTransfered / TIMEUNIT);
    packet_lost_local = (uint32_t)(packet_lost / TIMEUNIT);
    DataTransfered = 0;
    packet_lost = 0;

    UTIL_SEQ_SetTask(1 << CFG_TASK_APP_DATA_THROUGHPUT_ID, CFG_SCH_PRIO_0);
    return;
  }

  static void GattProcReq(DTC_SVC_ProfileState GattProcId)
  {
    tBleStatus status;

    switch(GattProcId)
    {
      case DTC_PROC_MTU_UPDATE:
        {
          APP_DBG_MSG("change ATT MTU size \n");

          status = aci_gatt_exchange_config(DTC_Context.connHandle);
          if (status != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("change MTU cmd failure: 0x%x\n", status);
          }
          UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);

          APP_DBG_MSG("DTC_PROC_MTU_UPDATE complete event received \n");
        }
        break;

      case DTC_DISC_ALL_PRIMARY_SERVICES:
        {
          APP_DBG_MSG("Discover all primary services \n");

          status = aci_gatt_disc_all_primary_services(DTC_Context.connHandle);
          if (status != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("Discover all primary services cmd failure: 0x%x\n", status);
          }
          UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);

          APP_DBG_MSG("DTC_DISC_ALL_PRIMARY_SERVICES complete event received \n");
        }
        break;

      case DTC_DISCOVER_CHARACS:
        {
          APP_DBG_MSG("Discover all char of service \n");

          status = aci_gatt_disc_all_char_of_service(
              DTC_Context.connHandle,
              DTC_Context.ServiceHandle,
              DTC_Context.ServiceEndHandle);
          if (status != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("Discover all char of service cmd failure: 0x%x\n", status);
          }
          UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);

          APP_DBG_MSG("DTC_DISCOVER_CHARACS complete event received \n");
        }
        break;

      case DTC_DISCOVER_DESC:
        {
          APP_DBG_MSG("Discover char descriptors \n");

          status = aci_gatt_disc_all_char_desc(
              DTC_Context.connHandle,
              DTC_Context.ServiceHandle,
              DTC_Context.ServiceEndHandle);
          if (status != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("Discover char descriptors cmd failure: 0x%x\n", status);
          }
          UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);

          APP_DBG_MSG("DTC_DISCOVER_DESC complete event received \n");
        }
        break;

      case DTC_ENABLE_TX_NOTIFICATION:
        {
          uint8_t notification[2] = {0x01, 0x00};

          APP_DBG_MSG("Enable Tx char descriptors \n");
          status = aci_gatt_write_char_desc(DTC_Context.connHandle,
                                            DTC_Context.TXCCCDescHdle,
                                            2,
                                            (uint8_t *) &notification[0]);

          if (status != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("Enable Tx char descriptors cmd failure: 0x%x\n", status);
          }
          UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);

          APP_DBG_MSG("DTC_ENABLE_TX_NOTIFICATION complete event received \n");
        }
        break;

