Emekuu/STM32-Switching-algorithm-for-energetic-systems/BLE_DataThroughput/STM32_WPAN/App/dt_client_app.c
      case DTC_ENABLE_THROUGHPUT_NOTIFICATION:
        {
          uint8_t notification[2] = {0x01, 0x00};

          APP_DBG_MSG("Enable Throughput char descriptors \n");
          status = aci_gatt_write_char_desc(DTC_Context.connHandle,
                                            DTC_Context.ThroughputCCCDescHdle,
                                            2,
                                            (uint8_t *) &notification[0]);

          if (status != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("Enable Throughput char descriptors cmd failure: 0x%x\n", status);
          }
          UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);

          APP_DBG_MSG("DTC_ENABLE_THROUGHPUT_NOTIFICATION complete event received \n");
        }
        break;

      default:
        break;
    }
    return;
  }

void DTC_Button1TriggerReceived( void )
{
  if(DTC_Context.ButtonTransferReq != DTC_APP_TRANSFER_REQ_OFF)
  {
    BSP_LED_Off(LED_BLUE);
    APP_DBG_MSG("LED BLUE OFF");
    DTC_Context.ButtonTransferReq = DTC_APP_TRANSFER_REQ_OFF;
  }
  else
  {
    BSP_LED_On(LED_BLUE);
    APP_DBG_MSG("LED BLUE ON");
    DTC_Context.ButtonTransferReq = DTC_APP_TRANSFER_REQ_ON;
    UTIL_SEQ_SetTask(1 << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
  }

  return;
}

void DTC_Button2TriggerReceived( void )
{
  APP_DBG_MSG("**CHANGE PHY \n");
  UTIL_SEQ_SetTask(1 << CFG_TASK_DATA_PHY_UPDATE_ID, CFG_SCH_PRIO_0);
  return;
}

static void Appli_UpdateButtonState(Button_TypeDef button, int isPressed)
{
  uint32_t t0 = 0,t1 = 1;

  t0 = HAL_GetTick(); /* SW3 press timing */
  
  while(BSP_PB_GetState(button) == BUTTON_PRESSED);
  t1 = HAL_GetTick(); /* SW3 release timing */
  
  if((t1 - t0) > LONG_PRESS_THRESHOLD)
  {
    if(button == BUTTON_SW1)
    {
      /* Button 1 long press action */
      DTC_Button1TriggerReceived();
    }
    else if(button == BUTTON_SW2)
    {
      /* Button 2 long press action */
      DTC_Button2TriggerReceived();
    }
    else if(button == BUTTON_SW3)
    {
      /* Button 3 long press action */
      APP_DBG_MSG("clear database \n");
      BLE_SVC_GAP_Clear_DataBase();
    }
  }
  else if((t1 - t0) > BOUNCE_THRESHOLD)
  {
    if(button == BUTTON_SW1)
    {
      /* Button 1 short press action */
      DTC_Button1TriggerReceived();
    }
    else if(button == BUTTON_SW2)
    {
      /* Button 2 short press action */
      DTC_Button2TriggerReceived();
    }
    else if(button == BUTTON_SW3)
    {
      /* Button 3 short press action */
      APP_DBG_MSG("pairing request \n");
      BLE_GAP_Pairing_Req();
    }
  }
}

static void DTC_App_Button1_Trigger_Received(void)
{
  Appli_UpdateButtonState(BUTTON_SW1, BSP_PB_GetState(BUTTON_SW1) == BUTTON_PRESSED);
  
  return;
}

static void DTC_App_Button2_Trigger_Received(void)
{
  Appli_UpdateButtonState(BUTTON_SW2, BSP_PB_GetState(BUTTON_SW2) == BUTTON_PRESSED);
  
  return;
}

static void DTC_App_Button3_Trigger_Received(void)
{
  Appli_UpdateButtonState(BUTTON_SW3, BSP_PB_GetState(BUTTON_SW3) == BUTTON_PRESSED);
  
  return;
}

static void SendData( void )
{
  tBleStatus status = BLE_STATUS_INVALID_PARAMS;
  uint8_t crc_result;

  if( (DTC_Context.ButtonTransferReq != DTC_APP_TRANSFER_REQ_OFF) &&
      (DTC_Context.DtFlowStatus != DTC_APP_FLOW_OFF) )
  {
    /*Data Packet to send to remote*/
    Notification_Data_Buffer[0] += 1;
    /* compute CRC */
    crc_result = APP_BLE_ComputeCRC8((uint8_t*) Notification_Data_Buffer, (Att_Mtu_Exchanged - 1));
    Notification_Data_Buffer[Att_Mtu_Exchanged - 1] = crc_result;

    DTC_Context.TxData.pPayload = Notification_Data_Buffer;
    DTC_Context.TxData.Length =  Att_Mtu_Exchanged;


    status = aci_gatt_write_without_resp(DTC_Context.connHandle,
                                         DTC_Context.RXCharHdle,
                                         Att_Mtu_Exchanged,
                                         (const uint8_t*)(DTC_Context.TxData.pPayload));

    if (status == BLE_STATUS_INSUFFICIENT_RESOURCES)
    {
      DTC_Context.DtFlowStatus = DTC_APP_FLOW_OFF;
      (Notification_Data_Buffer[0])-=1;
    }
    else
    {
      UTIL_SEQ_SetTask(1 << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
    }
  }
  return;
}

void Resume_Write(void)
{
  DTC_Context.DtFlowStatus = DTC_APP_FLOW_ON;
}
/* USER CODE BEGIN FD */

/* USER CODE END FD */
